ErpTest/src/Documents/уатИнвентаризацияГСМвТС/уатИнвентаризацияГСМвТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатИнвентаризацияГСМвТС</name>
  <comment>Документ инвентаризации остатков ГСМ в баках ТС</comment>
  <posting>Deny</posting>
  <attributes>
    <name>АЗС</name>
    <comment>Склад для подстановки в документ Слив ГСМ</comment>
    <type>
      <types>CatalogRef.уатАЗС</types>
    </type>
  </attributes>
  <attributes>
    <name>Колонна</name>
    <type>
      <types>CatalogRef.уатКолонны</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ГСМвТС</name>
    <attributes>
      <name>ГСМ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУчет</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУчет</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТС</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/Documents/уатИнвентаризацияГСМвТС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.уатИнвентаризацияГСМвТС";
	КомандаПечати.Идентификатор = "ИнвентаризацияГСМвТС";
	КомандаПечати.Представление = НСтр("ru = 'Инвентаризация'");
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИнвентаризацияГСМвТС") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИнвентаризацияГСМвТС",
			"Инвентаризация ГСМ в ТС", ПечатьИнвентаризацияГСМвТС(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	уатОбщегоНазначенияСервер.УстановитьРедактированиеПечатныхФормДокумента(КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	Заглушка = Истина;
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьИнвентаризацияГСМвТС(МассивОбъектов, ОбъектыПечати) 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ИнвентаризацияГСМвТС";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекДокумент Из МассивОбъектов Цикл 
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияГСМвТС_ИнвентаризацияГСМвТС";
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уатИнвентаризацияГСМвТС.ПФ_MXL_ИнвентаризацияГСМвТС");
		
		ПараметрыПечати = ПолучитьДанныеДляПечатиДокумента(ТекДокумент);
		
		Если ПараметрыПечати = Неопределено Тогда 
			Возврат ТабличныйДокумент;
		КонецЕсли;
		
		// Выводим шапку
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим шапку таблицы
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим строки ТЧ
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		Для Каждого ПараметрыСтроки Из ПараметрыПечати.Строки Цикл
			ОбластьМакета.Параметры.Заполнить(ПараметрыСтроки);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		// Выводим итоги таблицы
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим подписи к документу
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Функция помещает в структуру все данные, отображаемые при печати документа.
// Вызывается из функции ПечатьДокумента и из веб-приложения
//
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьДанныеДляПечатиДокумента(ТекущийДокумент) Экспорт
	
	ВалютаПечати = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ТекущийДокумент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатИнвентаризацияГСМвТСГСМвТС.ГСМ КАК ГСМ,
	|	уатИнвентаризацияГСМвТСГСМвТС.ЕдиницаИзмерения,
	|	уатИнвентаризацияГСМвТСГСМвТС.Количество,
	|	уатИнвентаризацияГСМвТСГСМвТС.КоличествоУчет,
	|	уатИнвентаризацияГСМвТСГСМвТС.Сумма КАК Сумма,
	|	уатИнвентаризацияГСМвТСГСМвТС.СуммаУчет КАК СуммаУчет,
	|	уатИнвентаризацияГСМвТСГСМвТС.ТС КАК ТС,
	|	уатИнвентаризацияГСМвТСГСМвТС.Цена,
	|	уатИнвентаризацияГСМвТС.Номер КАК Номер,
	|	уатИнвентаризацияГСМвТС.Дата КАК Дата,
	|	уатИнвентаризацияГСМвТС.Организация КАК Организация,
	|	уатИнвентаризацияГСМвТСГСМвТС.Ссылка КАК Ссылка,
	|	уатИнвентаризацияГСМвТСГСМвТС.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.уатИнвентаризацияГСМвТС.ГСМвТС КАК уатИнвентаризацияГСМвТСГСМвТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатИнвентаризацияГСМвТС КАК уатИнвентаризацияГСМвТС
	|		ПО уатИнвентаризацияГСМвТСГСМвТС.Ссылка = уатИнвентаризацияГСМвТС.Ссылка
	|ГДЕ
	|	уатИнвентаризацияГСМвТСГСМвТС.Ссылка = &ДокументСсылка
	|
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаУчет),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация)
	|ПО
	|	Ссылка";
	
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаДокумент.Следующий() Тогда
		
		ПараметрыПечати = Новый Структура;
		
		// Выводим шапку
		ПараметрыПечати.Вставить("ТекстЗаголовка",           уатОбщегоНазначенияТиповые.уатСформироватьЗаголовокДокумента(ВыборкаДокумент.Ссылка, "Инвентаризация ГСМ в ТС"));
		ПараметрыПечати.Вставить("ОрганизацияПредставление", уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(ВыборкаДокумент.Организация, ВыборкаДокумент.Дата), "ПолноеНаименование,"));
		ПараметрыПечати.Вставить("ВалютаНаименование",       СокрЛП(ВалютаПечати));
		ПараметрыПечати.Вставить("Валюта",                   ВалютаПечати);
		
		// Вывод строк ТЧ ГСМвТС
		Строки         = Новый Массив;
		ВыборкаСтрокТЧ = ВыборкаДокумент.Выбрать();
		
		Пока ВыборкаСтрокТЧ.Следующий() Цикл 
			// Выводим строку таблицы
			ПараметрыСтроки = Новый Структура;
			
			ПараметрыСтроки.Вставить("НомерСтроки",    ВыборкаСтрокТЧ.НомерСтроки);
			ПараметрыСтроки.Вставить("ТС",             ВыборкаСтрокТЧ.ТС);
			ПараметрыСтроки.Вставить("ГСМ",            ВыборкаСтрокТЧ.ГСМ);
			ПараметрыСтроки.Вставить("Количество",     ВыборкаСтрокТЧ.Количество);
			ПараметрыСтроки.Вставить("КоличествоУчет", ВыборкаСтрокТЧ.КоличествоУчет);
			ПараметрыСтроки.Вставить("Цена",           ВыборкаСтрокТЧ.Цена);
			ПараметрыСтроки.Вставить("Сумма",          ВыборкаСтрокТЧ.Сумма);
			ПараметрыСтроки.Вставить("СуммаУчет",      ВыборкаСтрокТЧ.СуммаУчет);
			
			Если ЗначениеЗаполнено(ВыборкаСтрокТЧ.ЕдиницаИзмерения) Тогда 
				ПараметрыСтроки.Вставить("ЕдиницаИзмерения", ВыборкаСтрокТЧ.ЕдиницаИзмерения);
			Иначе 
				ПараметрыСтроки.Вставить("ЕдиницаИзмерения", ВыборкаСтрокТЧ.ГСМ.ЕдиницаИзмерения);
			КонецЕсли;
			
			Строки.Добавить(ПараметрыСтроки);
		КонецЦикла;
		
		ПараметрыПечати.Вставить("Строки", Строки);
		
		// Вывести Итого
		ПараметрыПечати.Вставить("Всего",        уатОбщегоНазначенияТиповые.уатФорматСумм(ВыборкаДокумент.Сумма));
		ПараметрыПечати.Вставить("ВсегоПоУчету", уатОбщегоНазначенияТиповые.уатФорматСумм(ВыборкаДокумент.СуммаУчет));
		
		Возврат ПараметрыПечати;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции //ПолучитьДанныеДляПечатиДокумента()

#КонецОбласти

#КонецЕсли
